tests/cases/runnerNetwork/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application     foamRun;
solver          moldingFoam;
libs            ("libmoldingFoam.so");
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.5;
deltaT          1e-05;
writeControl    adjustableRunTime;
writeInterval   0.5;
writeFields     false;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable no;
adjustTimeStep  on;
maxCo           0.5;
maxAlphaCo      0.1;
maxDeltaT       0.01;

functions
{
    inletMassFlow
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        writeFields     no;
        log             yes;
        patch           inlet;
        operation       sum;
        fields          (alphaRhoPhi.melt);
    }
}
