tests/cases/runnerNetwork/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam contract case
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Phase definition: melt (polymer, phase 1) and air (phase 2) with a
    constant surface tension coefficient at the interface.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (melt air);

sigma
{
    type    constant;
    sigma   [1 0 -2 0 0 0 0] 0.025;
}

// ************************************************************************* //
