tests/cases/runnerNetwork/system/expectedPatterns
moldingFoam: read .*moldingDict
End
