tests/cases/runnerNetwork/system/verifyScript
verify-runner-network.py
